In [13]:
import numpy as np
import pandas as pd 
path = '../data/processed/'
categories = pd.read_csv(path + 'categories.csv')
areas = [pd.read_csv(path + 'area' + str(i) + '.csv') for i in range(1, 8)]

seed = 42
np.random.seed(seed)

In [14]:
categories

   Child  Adult  Electric  Racing  Mountain  Tricycle
0    272  270.0     279.0   267.0     282.0       279
1      1    1.5       1.5     1.7       1.7         4

In [15]:
def expected_profits(categories, area):
    profit = pd.DataFrame(columns=categories.columns, index=[0])
    number = pd.DataFrame(columns=categories.columns, index=[0])

    for column in categories.columns:
        number[column] = np.random.randint(0, categories[column][0]-250)
        profit[column] = sum(area[column][:number[column][0]])

    return number, profit

In [16]:
number, profit = expected_profits(categories, areas[0])

In [17]:
number

   Child  Adult  Electric  Racing  Mountain  Tricycle
0      6     19        28      14        10         7

In [18]:
profit

      Child     Adult  Electric   Racing  Mountain  Tricycle
0  218.5638  447.6968  664.9274  408.661  236.7164  207.0703

In [19]:
areas[0][:20].sum()

Child       613.3544
Adult       474.5669
Electric    542.4898
Racing      515.1509
Mountain    501.1026
Tricycle    613.2416
dtype: float64

In [20]:
categories

   Child  Adult  Electric  Racing  Mountain  Tricycle
0    272  270.0     279.0   267.0     282.0       279
1      1    1.5       1.5     1.7       1.7         4

In [21]:
profit = pd.DataFrame()
number = pd.DataFrame()
for area in areas:
    n, p = expected_profits(categories, area)
    number = pd.concat([number, n], ignore_index=True)
    profit = pd.concat([profit, p], ignore_index=True)

number

   Child  Adult  Electric  Racing  Mountain  Tricycle
0     20      6        25      10        10        23
1     20      3         7       2        21        20
2      1     11         5       1        31        27
3     20      0        11      11        24        16
4      9     15        14      14        29        18
5     11     19        24       2         4        18
6      6      8         6       3        24        27

In [22]:
profit.style.highlight_max(color='lightblue', axis=0)

In [23]:
print(f'Lucro: {profit.sum().sum()}')

Lucro: 13514.521299999999

In [34]:
capacidade = np.sum(np.sum(number.values * categories.iloc[1].values, axis=1))
print(f'Capacidade: {capacidade}')

Capacidade: 1230.2